# 두 개의 동일한 크기의 Matrix를 더하는 Madd 함수를 구현하라.
def Madd(X: list, Y: list) -> list:
    # assert를 사용하여 행렬의 크기가 동일한지 검사
    assert len(X) == len(Y) and all(len(rowX) == len(rowY) for rowX, rowY in zip(X, Y)), "두 행렬의 크기가 같아야 합니다."
    
    # 두 행렬의 원소를 더한 결과 반환
    return [[X[i][j] + Y[i][j] for j in range(len(X[0]))] for i in range(len(X))]


# --------------------------------------- 예제 (1) ---------------------------------------
A = [[1, 2, 3], [4, 5, 6], [7, 8, 9]]
B = [[1, 0, 0], [0, 1, 0], [0, 0, 1]]

try:
    print("res1 : ", end="")
    print(Madd(A, B))
except AssertionError as e:
    print(e)  # "두 행렬의 크기가 같아야 합니다."
# ---------------------------------------------------------------------------------------



# --------------------------------------- 예제 (2) ---------------------------------------
C = [[1, 2], [3, 4]]
D = [[1, 2, 3], [4, 5, 6]]

try:
    print("res2 : ", end="")
    print(Madd(C, D))
except AssertionError as e:
    print(e)  # "두 행렬의 크기가 같아야 합니다."
# ---------------------------------------------------------------------------------------